load-test.yml
config:
  target: "https://backend-production-a93d.up.railway.app"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Phase 1 - Low load"
    - duration: 120
      arrivalRate: 50
      name: "Phase 2 - High load"

scenarios:
  - name: "Health check and students"
    flow:
      - get:
          url: "/health"
      - get:
          url: "/api/v1/students/"